DROP DATABASE IF EXISTS lab1;
CREATE DATABASE lab1;
USE lab1;
CREATE TABLE BOOKS(
    id INT NOT NULL PRIMARY KEY,
    book_code INT NOT NULL,
    is_new BOOL DEFAULT TRUE,
    book_name VARCHAR(100) CHARACTER SET utf8 NOT NULL,
    book_cost DECIMAL(5,2) NOT NULL,
    publishing_house VARCHAR(20) CHARACTER SET utf8,
    pages_num INT,
    book_format VARCHAR(20) CHARACTER SET utf8,
    publishing_date DATE	,
	tirage INT,
    book_topic VARCHAR(50) CHARACTER SET utf8,
    book_cathegory VARCHAR(30) CHARACTER SET utf8,
    CHECK(book_cost < 150.00)
);
INSERT INTO BOOKS(id, book_code, is_new, book_name, book_cost, publishing_house, pages_num, book_format, publishing_date, tirage, book_topic, book_cathegory)
VALUES  (2, 5110, FALSE, "Апаратні засоби мультимедія. відеосистема РС", 15.51, 'BHV С.-Петербург', 400, '70х100 / 16', '2000-7-24', 5000, 'Використання ПК в цілому', 'підручники'),
        (8, 4985, FALSE, 'Освой самостійно модернізацію і ремонт ПК за 24 години, 2-е вид.', 18.90, 'Вільямс', 288, '70х100 / 16', '2000-7-7', 5000, 'Використання ПК в цілому', 'підручники'),
        (9, 5141, FALSE, 'Структури даних і алгоритми.', 37.80, 'Вільямс', 384, '70х100 / 16', '2000-9-29', 5000, 'Використання ПК в цілому', 'підручники'),
        (20, 5127, TRUE, 'Автоматизація інженерно графічних робіт', 11.58, 'Пітер', 256, '70х100 / 16', '2000-6-15',  5000, 'Використання ПК в цілому', 'підручники'),
        (31, 5110, FALSE, 'Апаратні засоби мультимедія. відеосистема РС', 15.51, 'BHV С.-Петербург', 400, '70х100 / 16', '2000-7-24', 5000, 'Використання ПК в цілому', 'Апаратні засоби ПК'),
        (46, 5199, FALSE, 'Залізо IBM 2001.', 30.07, 'МікроАрт', 368, '70х100 / 16', '2000-2-12', 5000, 'Використання ПК в цілому', 'Апаратні засоби ПК'),
        (50, 3851, TRUE, 'Захист інформації і безпека комп\'ютерних систем', 26.00, 'DiaSoft', 480, '84х108 / 16', '1999-2-4', 5000, 'Використання ПК в цілому', 'Захист і безпека ПК'),
        (58, 3932, FALSE, 'Як перетворити персональний комп\'ютер у вимірювальний комплекс', 7.65, 'ДМК', 144, '60х88 / 16', '1999-6-9', 5000,'Використання ПК в цілому', 'інші книги'),
        (59, 4713, FALSE, 'Plug- ins. Вбудовувані додатки для музичних програм', 11.41, 'ДМК', 144, '70х100 / 16', '2000-2-22', 5000, 'Використання ПК в цілому', 'інші книги'),
        (175, 5217, FALSE, 'Windows МЕ. Новітні версії програм', 16.57, 'Тріумф', 320, '70х100 / 16', '2000-8-25', 5000, 'Операційні системи', 'Windows 2000'),
        (176, 4829, FALSE, 'Windows 2000 Professional крок за кроком з З D', 27.25, 'Еком', 320,'70х100 / 16', '2000-4-28', 5000, 'Операційні системи', 'Windows 2000'),
        (188, 5170, FALSE, 'Linux Російські версії', 24.43, 'ДМК', 346, '70х100 / 16', '2000-9-29', 5000, 'Операційні системи', 'Linux'),
        (191, 860, FALSE, 'Операційна система UNIX', 3.50, 'BHV С.-Петербург', 395, '84х100 \ 16', '1997-5-5', 5000, 'Операційні системи', 'Unix'),
        (203, 44, FALSE, 'Відповіді на актуальні питання по OS / 2 Warp', 5.00, 'DiaSoft', 352, '60х84 / 16', '1996-3-20', 5000, 'Операційні системи', 'Інші операційні системи'),
        (206, 5176, FALSE, 'Windows Ме. супутник користувача', 12.79, 'Російська редакція', 306, NULL, '2000-10-10', 5000, 'Операційні системи', 'Інші операційні системи'),
        (209, 5462, FALSE, 'Мова програмування С ++. Лекції і вправи', 29.00, 'DiaSoft', 656, '84х108 / 16', '2000-12-12', 5000, 'програмування', 'C & C ++'),
        (210, 4982, FALSE, 'Мова програмування С. Лекції і вправи', 29.00, 'DiaSoft', 432, '84х108 / 16', '2000-7-12', 5000, 'програмування', 'C & C ++'),
        (220, 4687, FALSE, 'Ефективне використання C ++ .50 рекомендацій щодо поліпшення ваших програм і проектів', 17.60, 'ДМК', 240, '70х100 / 16', '2000-2-3', 5000, 'програмування', 'C & C ++');
ALTER TABLE BOOKS ADD author VARCHAR(15) CHARACTER SET utf8;
ALTER TABLE BOOKS MODIFY COLUMN author VARCHAR(20) CHARACTER SET utf8;
ALTER TABLE BOOKS DROP COLUMN author;
ALTER TABLE BOOKS ADD INDEX book_code(book_code);
ALTER TABLE BOOKS DROP INDEX book_code;